cl-fuseki - Semantic Web Database Connection

#+tags: code lisp thesis rdf owl database semanticweb
#+PROPERTY: header-args :tangle no :cache no :session yes :results silent :no-expand no :noweb yes :exports code
#+startup: hideblocks overview

This file describes the a lisp-api for fuseki.

#+begin_src lisp :tangle cl-fuseki.lisp :exports none
  (in-package :cl-fuseki)
  
  <<support-functions>>
  
  <<simplifications>>

  <<postponed-updates>>
  
  <<drakma-configuration>>

  <<send-receive-request>>
  
  <<base-classes>>
  
  <<endpoint-construction>>
  
  <<logging>>

  <<query>>
  <<update>>
  <<ask>>
  <<insert-and-delete>>
#+end_src

#+RESULTS:
: #<package "CL-FUSEKI">

